##############################################################################
tap "homebrew/bundle"
tap "homebrew/services"
tap "felixkratz/formulae"
##############################################################################
# LANGUAGES
brew "node"
brew "python@3.12"
# brew "go"
# brew "php"
# brew "lua"
##############################################################################
# PACKAGE MANAGER
brew "luarocks"
brew "nvm"
brew "yarn"
brew "pnpm"
##############################################################################
brew "coreutils"
brew "bat" # Better cat
brew "fzf"
brew "git"
brew "neovim"
brew "ripgrep"
brew "tmux"
brew "unar"
brew "eza" # Replacement for ls
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-vi-mode"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "watchman" # Watch files and take action when they change
brew "wget"
brew "starship"
brew "bash"
# Start: `brew services restart svim` and provide accessibility permissions
brew "felixkratz/formulae/svim" # Adds vim moves and modes to macOS text fields
brew "yazi"
brew "btop"
brew "fastfetch"
# brew "jq"
# brew "sketchybar"
# brew "awscli"
##############################################################################
cask "ghostty"
cask "google-chrome"
cask "spotify"
cask "karabiner-elements"
cask "rectangle"
cask "scoot" # Cursor actuator
cask "hammerspoon"
cask "discord"
cask "whatsapp"
cask "slack"
# cask "blender"
# cask "expo-orbit"
# cask "ngrok"
# cask "orbstack"
# cask "keycastr"
# cask "steermouse"
# cask "obs"
# cask "mamp"
# cask "iterm2"
# cask "logi-options+"
# cask "dbeaver-community"
# cask "handbrake"
# cask "grammarly-desktop"
# cask "free-download-manager"
# cask "lulu"
# cask "openvpn-connect"
# cask "vlc"
# cask "zoom"
# cask "android-file-transfer"
# cask "android-studio"
##############################################################################
# NOT ON HOMEBREW
# - Quillbot
# - Xcode
##############################################################################
