tap "homebrew/bundle"
tap "homebrew/services"
# tap "felixkratz/formulae"

# LANGUAGES
brew "python@3.12"
# brew "go"
# brew "php"
# brew "lua"

# PACKAGE MANAGER
brew "luarocks"
brew "nvm"
brew "yarn"

# brew "awscli"

# Better cat
brew "bat"
brew "fzf"
brew "git"
brew "neovim"
brew "ripgrep"
brew "tmux"
brew "unar"

# Replacement for ls
brew "eza"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-vi-mode"

# Watch files and take action when they change
brew "watchman"
brew "wget"
# Adds vim moves and modes to macOS text fields
# brew "felixkratz/formulae/svim"
cask "ngrok"
# cask "orbstack"
cask "ghostty"
# Cursor actuator
# cask "scoot"
# brew "jq"
# brew "sketchybar"

cask "google-chrome"
# cask "obsidian"
cask "spotify"
# cask "hammerspoon"
# brew "btop"
# brew "fastfetch"
cask "expo-orbit"
# cask "keycastr"
# cask "steermouse"
# cask "obs"
# cask "discord"

